#На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
#1.  Строится двоичная запись числа N.
#2.  К этой записи дописываются справа ещё два разряда по следующему правилу: складываются все цифры двоичной записи:
#а)  если сумма нечетная, к числу дописывается 11,
#б)  если сумма четная, дописывается 00.
#Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R. Укажите такое наименьшее число R, которое превышает 114 и может являться результатом работы алгоритма. В ответе это число запишите в десятичной системе счисления.
#https://vk.ru/away.php?to=https%3A%2F%2Finf-ege.sdamgia.ru%2Fproblem%3Fid%3D15622&utf=1

#Ответ: 115

for n in range(1, 1000):
  s = bin(n)[2:]
  summa = sum(int(c) for c in s)
  if summa % 2 != 0:
    s += "11"
  else:
    s += "00"
  r = int(s, 2)
  if r > 114:
    print(r)
    break
