#На вход программе подаётся целое число S — сумма в рублях (положительное). Нужно разменять эту сумму на монеты достоинством 1, 2, 5 и 10 рублей, используя жадный подход: сначала брать максимально возможное количество монет наибольшего номинала, затем следующего и так далее.

# Пример входных данных:
# 67
#
# Ответ:
# 6 по 10 руб.
# 1 по 5 руб.
# 1 по 2 руб.
# 0 по 1 руб.
#
# *Усложнение: если монеты какого либо номинала не нужны, не печатать строку с нулём.
s = int(input("введите сумму"))
m10 = s // 10
m5 = (s - 10 * m10) // 5
m2 = (s - 10 * m10 - 5 * m5) // 2
m1 = (s - 10 * m10 - 5 * m5 - 2 * m2)
if m10 > 0:
    print(m10, "по 10 рублей")
if m5 > 0:
    print(m5, "по 5 рублей")
if m2 > 0:
    print(m2, "по 2 рубля")
if m1 > 0:
    print(m1, "по 1 рублю")

